validation.firstName.null=Le pr\u00e9nom est obligatoire.
validation.firstName.size=Le pr\u00e9nom doit avoir entre {min} et {max} caract\u00e8res.
validation.lastName.null=Le nom de famille est obligatoire.
validation.lastName.size=Le nom de famille doit avoir entre {min} et {max} caract\u00e8res.
validation.phone.null=Le num\u00e9ro de t\u00e9l\u00e9phone est obligatoire.
validation.phone.pattern=Le t\u00e9l\u00e9phone doit \u00eatre sous la forme de (XXX) XXX-XXXX.
validation.password.null=Le mot de passe est obligatoire.
validation.password.size=Le mot de passe doit avoir entre {min} et {max} caract\u00e8res.
validation.password.pattern=Le mot de passe doit inclure au moins une lettre, un chiffre et un caract\u00e8re sp\u00e9cial.
validation.email.null=L'adresse e-mail est obligatoire.
validation.email.pattern=L'adresse e-mail doit \u00eatre sous la forme d'une adresse e-mail.
validation.reset-code.null=Le code de r\u00e9initialisation est obligatoire.
validation.role.null=Le type de r\u00f4le est obligatoire.

validation.advert.notnull=Le titre ne peut pas \u00eatre nul.
validation.advert.size=Votre titre doit avoir entre 5 et 150 caract\u00e8res.
validation.advert.desc.size=Votre description doit avoir au maximum 300 caract\u00e8res.
validation.advert.price.notnull=Le prix ne peut pas \u00eatre nul.
validation.advert.type.notnull=L'identifiant du type d'annonce ne peut pas \u00eatre nul.
validation.advert.country.notnull=L'identifiant du pays ne peut pas \u00eatre nul.
validation.advert.city.notnull=L'identifiant de la ville ne peut pas \u00eatre nul.
validation.advert.district.notnull=L'identifiant du quartier ne peut pas \u00eatre nul.
validation.advert.category.notnull=L'identifiant de la cat\u00e9gorie ne peut pas \u00eatre nul.
validation.advert.id.notnull=L'identifiant de l'annonce ne peut pas \u00eatre nul.

validation.category.name.notnull=Le nom de la cat\u00e9gorie ne peut pas \u00eatre nul.
validation.category.name.size=Le nom de la cat\u00e9gorie doit avoir entre {min} et {max} caract\u00e8res.
validation.category.title.notnull=Le titre ne peut pas \u00eatre nul.
validation.category.title.size=Le titre doit avoir moins de {max} caract\u00e8res.
validation.category.icon.notnull=L'ic\u00f4ne ne peut pas \u00eatre nulle.
validation.category.icon.size=L'ic\u00f4ne doit avoir moins de {max} caract\u00e8res.
validation.category.seq.notnull=La s\u00e9quence ne peut pas \u00eatre nulle.
validation.category.is-active.notnull=L'activation ne peut pas \u00eatre nulle.

validation.tour.request.tour.date.notnull=La date de la visite ne peut pas \u00eatre nulle.
validation.tour.request.tour.time.notnull=L'heure de la visite ne peut pas \u00eatre nulle.
validation.tour.request.tour.date.future=La date de la visite ne peut pas \u00eatre dans le pass\u00e9.

error.reset-code.invalid=Le code de r\u00e9initialisation du mot de passe n'est pas valide.
error.user.not-found.id=Utilisateur non trouv\u00e9 avec cet identifiant.
error.user.update.not-found=Utilisateur non trouv\u00e9.
error.user.update.unauthorized=Vous ne pouvez pas mettre \u00e0 jour un utilisateur avec un r\u00f4le autre que CLIENT.
error.user.update.built-in=Cet utilisateur ne peut pas \u00eatre mis \u00e0 jour.
error.user.delete.unauthorized=Vous ne pouvez pas supprimer un utilisateur avec un r\u00f4le autre que CLIENT.
error.user.delete.built-in=Cet utilisateur ne peut pas \u00eatre supprim\u00e9.
error.user.delete.adverts=L'utilisateur ne peut pas \u00eatre supprim\u00e9 car il a une annonce.
error.user.delete.tou-requests=L'utilisateur ne peut pas \u00eatre supprim\u00e9 car il a une demande de visite.
error.login.bad-credentials=Adresse e-mail ou mot de passe incorrect. Veuillez v\u00e9rifier vos identifiants et r\u00e9essayer.
error.mail.reset-password=Une erreur s'est produite lors de l'envoi de l'e-mail de r\u00e9initialisation du mot de passe. Veuillez r\u00e9essayer plus tard. %s
error.phone.exists=Le num\u00e9ro de t\u00e9l\u00e9phone existe d\u00e9j\u00e0.
error.email.exists=L'email existe d\u00e9j\u00e0.
error.user.password.invalid=Le mot de passe actuel ne correspond pas \u00e0 votre mot de passe.

error.tour-time.conflict=Votre demande de visite existe d\u00e9j\u00e0.
error.tour-request.not-found=Demande de visite non trouv\u00e9e.
error.tour-request.pending-or-declined=Seules les demandes de visite dont le statut est en attente ou rejet\u00e9 peuvent \u00eatre mises \u00e0 jour.
error.tour-time.bad-request=Vous pouvez prendre rendez-vous pour votre visite \u00e0 des heures pleines ou \u00e0 des heures et demie.

error.city.not-found=Ville non trouv\u00e9e.
error.country.not-found=Pays non trouv\u00e9.
error.district.not-found=Quartier non trouv\u00e9.

error.category.save.exist=La cat\u00e9gorie existe d\u00e9j\u00e0.
error.category.save.duplicate.slug=Le Slug existe d\u00e9j\u00e0.
error.category.save.not-alphabetic=Le titre doit \u00eatre compos\u00e9 uniquement de lettres.
error.category.not-found=Cat\u00e9gorie non trouv\u00e9e.
error.category.delete.built-in=Cette cat\u00e9gorie ne peut pas \u00eatre supprim\u00e9e.
error.category.update.built-in=Cette cat\u00e9gorie ne peut pas \u00eatre mise \u00e0 jour.
error.category.delete.advert=Cette cat\u00e9gorie ne peut pas \u00eatre supprim\u00e9e. Il y a des annonces li\u00e9es \u00e0 la cat\u00e9gorie que vous souhaitez supprimer.
error.categories.not.found=Cat\u00e9gorie non trouv\u00e9e par ID : %d.
error.category.property.value.not.found=La valeur de propri\u00e9t\u00e9 de cat\u00e9gorie non trouv\u00e9e par ID : %d.
error.cpk.save.duplicate.name.in.category=La cat\u00e9gorie a d\u00e9j\u00e0 une cl\u00e9 de propri\u00e9t\u00e9 avec le m\u00eame nom.
error.cpk.delete.built-in=La cl\u00e9 de propri\u00e9t\u00e9 de cat\u00e9gorie ne peut pas \u00eatre supprim\u00e9e.
error.cpk.update.built-in=La cl\u00e9 de propri\u00e9t\u00e9 de cat\u00e9gorie ne peut pas \u00eatre mise \u00e0 jour.

error.advert.price.start.gt.price.end=Le prix de d\u00e9part doit \u00eatre inf\u00e9rieur au prix final.
error.advert.permission=Vous ne pouvez pas voir cette annonce car vous n'avez pas la permission de la voir.
error.advert.builtin=L'annonce ne peut pas \u00eatre mise \u00e0 jour.
error.advert.not.found=Annonce non trouv\u00e9e par ID : %d.
error.advert.not.found.slug=Annonce non trouv\u00e9e par Slug : %s.

error.advert.type.not.found=Type d'annonce non trouv\u00e9 par ID : %d.

error.image.not.found=Vous devez t\u00e9l\u00e9charger au moins une image.
error.image.not.found.id=Image non trouv\u00e9e par ID : %d.
error.image.not.delete=Vous ne pouvez pas supprimer toutes les images d'une annonce.
error.image.too.many=Vous ne pouvez pas t\u00e9l\u00e9charger plus de 10 images

error.report.date=La date de d\u00e9but ne peut pas \u00eatre apr\u00e8s la date de fin.

success.favorites.successfully.deleted=Favoris supprim\u00e9s avec succ\u00e8s.
success.favorite.successfully.deleted=Favori supprim\u00e9 avec succ\u00e8s.

success.contact.saved=Contact enregistr\u00e9 avec succ\u00e8s.

success.tour-request.created=Demande de visite cr\u00e9\u00e9e.
success.tour-request.approved=Demande de visite accept\u00e9e.
success.tour-request.declined=Demande de visite refus\u00e9e.
success.tour-request.canceled=Demande de visite annul\u00e9e.
